package home.chapter02cycles.task17;

/**
 * Раздел "Циклы"
 * Задание №17
 *
 * Задать произвольное целое число и вывести его в бухгалтерском формате, то есть, начиная справа,
 * каждые три позиции отделяются пробелом.
 * Например, число 20023143 должно быть выведено как 20 023 143.
 *
 * @author Yusikau Aliaksandr
 * @version 1.0
 */

public class Runner {

    public static void main(String[] args) {

        Number num01 = new Number(-871_238_710_000L);
        System.out.println(num01);
    }
}
